Public Attributes | List of all members
API_RailingPostType Struct Reference
Element Manager
Represents a Railing Post element. More...
#include <APIdefs_Elements.h>
 Public Attributes
 API_Elem_Head  | head
General element header.
 API_Guid  | owner
GUID of the Railing Node element owning this Railing Post.
 API_Guid  | symbID
The identifier of the symbol of this element.
 API_RailingVerticalPosData  | verticalPosition
Vertical alignment of the Railing Post.
Detailed Description
Represents a Railing Post element.